Repository: Law4Hire/L4H
Catalog: src/api/Resources/Shared.*.resx
Languages: es, es_es

# Auth.LoginFailed
source: Invalid email or password.
es_es: Correo o contraseña inválidos.

# Cases.InvalidTransition
source: Invalid status transition.
es_es: Transición de estado inválida.

# Pricing.MissingVisaType
source: Visa type not found or not active.
es_es: Tipo de visa no encontrado o no activo.

# Admin.Forbidden
source: Admin access required.
es_es: Acceso de administrador requerido.

# Admin.PricingUpdated
source: Pricing information updated successfully.
es_es: Información de precios actualizada exitosamente.

# Admin.VisaTypeNotFound
source: Visa type not found.
es_es: Tipo de visa no encontrado.

source: Interview session not found.
es_es: Sesión de entrevista no encontrada.

# Interview.Forbidden
source: You do not have access to this interview session.
es_es: No tienes acceso a esta sesión de entrevista.

# Interview.Locked
source: Interview is locked and cannot be modified.
es_es: La entrevista está bloqueada y no se puede modificar.

# Interview.AnswerSaved
source: Answer saved successfully.
es_es: Respuesta guardada exitosamente.

# Interview.Completed
source: Interview completed successfully.
es_es: Entrevista completada exitosamente.

# Interview.Rationale.TourismB2
source: Based on your purpose of travel, a B-2 Tourist Visa is recommended.
es_es: Basado en tu propósito de viaje, se recomienda una Visa de Turista B-2.

# Interview.Rationale.EmploymentH1B
source: Based on your employment with sponsor, an H-1B Specialty Occupation Visa is recommended.
es_es: Basado en tu empleo con patrocinador, se recomienda una Visa de Ocupación Especializada H-1B.

# Seeds.CountriesLoaded
source: Countries seed data loaded successfully.
es_es: Datos semilla de países cargados exitosamente.

# Seeds.SubdivisionsLoaded
source: US Subdivisions seed data loaded successfully.
es_es: Datos semilla de subdivisiones de EE.UU. cargados exitosamente.

# Seeds.VisaClassesLoaded
source: Visa Classes seed data loaded successfully.
es_es: Datos semilla de clases de visa cargados exitosamente.

# VisaChange.StaffOnly
source: Only staff members can propose visa changes.
es_es: Solo los miembros del personal pueden proponer cambios de visa.

# VisaChange.CaseLocked
source: This case is locked and cannot be modified.
es_es: Este caso está bloqueado y no se puede modificar.

# VisaChange.PendingExists
source: There is already a pending visa change request for this case.
es_es: Ya existe una solicitud de cambio de visa pendiente para este caso.

# VisaChange.VisaTypeNotFound
source: The requested visa type was not found or is not active.
es_es: El tipo de visa solicitado no fue encontrado o no está activo.

# VisaChange.SameVisaType
source: Cannot change to the same visa type.
es_es: No se puede cambiar al mismo tipo de visa.

# VisaChange.PriceCalculationFailed
source: Unable to calculate price difference for this visa change.
es_es: No se pudo calcular la diferencia de precio para este cambio de visa.

source: Visa change request not found.
es_es: Solicitud de cambio de visa no encontrada.

# VisaChange.ClientOnly
source: Only the case owner can approve or reject visa change requests.
es_es: Solo el propietario del caso puede aprobar o rechazar solicitudes de cambio de visa.

# VisaChange.NotPending
source: This visa change request is no longer pending.
es_es: Esta solicitud de cambio de visa ya no está pendiente.

# VisaChange.Expired
source: This visa change request has expired.
es_es: Esta solicitud de cambio de visa ha expirado.

# VisaChange.Approved
source: Visa change request approved successfully.
es_es: Solicitud de cambio de visa aprobada exitosamente.

# VisaChange.Rejected
source: Visa change request rejected.
es_es: Solicitud de cambio de visa rechazada.

# Appointments.AccessDenied
source: You do not have access to this appointment.
es_es: No tienes acceso a esta cita.

# Appointments.ExistingActive
source: There is already an active appointment for this case.
es_es: Ya existe una cita activa para este caso.

# Appointments.NoStaffAvailable
source: No staff members are available at the requested time.
es_es: No hay miembros del personal disponibles en el horario solicitado.

# Appointments.SchedulingConflict
source: The requested time conflicts with existing appointments.
es_es: El horario solicitado conflicta con citas existentes.

# Appointments.NotFound
source: Appointment not found.
es_es: Cita no encontrada.

# Appointments.StaffMismatch
source: You can only modify appointments assigned to you.
es_es: Solo puedes modificar citas asignadas a ti.

# Appointments.CannotReschedule
source: This appointment cannot be rescheduled in its current status.
es_es: Esta cita no se puede reprogramar en su estado actual.

# Appointments.RescheduleLimit
source: You have reached the maximum number of reschedule requests (2 per side).
es_es: Has alcanzado el número máximo de solicitudes de reprogramación (2 por lado).

# Appointments.PendingReschedule
source: There is already a pending reschedule request for this appointment.
es_es: Ya existe una solicitud de reprogramación pendiente para esta cita.

# Appointments.AllOptionsConflict
source: All proposed reschedule options conflict with existing appointments.
es_es: Todas las opciones de reprogramación propuestas conflictan con citas existentes.

# Appointments.InvalidOption
source: Please choose a valid option (1, 2, or 3).
es_es: Por favor elige una opción válida (1, 2, o 3).

# Appointments.ProposalNotFound
source: Reschedule proposal not found.
es_es: Propuesta de reprogramación no encontrada.

# Appointments.StaffResponseRequired
source: This reschedule request requires a staff response.
es_es: Esta solicitud de reprogramación requiere una respuesta del personal.

# Appointments.ClientResponseRequired
source: This reschedule request requires a client response.
es_es: Esta solicitud de reprogramación requiere una respuesta del cliente.

# Appointments.ProposalNotPending
source: This reschedule proposal is no longer pending.
es_es: Esta propuesta de reprogramación ya no está pendiente.

# Appointments.ProposalExpired
source: This reschedule proposal has expired.
es_es: Esta propuesta de reprogramación ha expirado.

# Appointments.ChosenOptionConflicts
source: The chosen reschedule option now conflicts with other appointments.
es_es: La opción de reprogramación elegida ahora conflicta con otras citas.

# Appointments.CannotCancel
source: This appointment cannot be cancelled in its current status.
es_es: Esta cita no se puede cancelar en su estado actual.

# Forms.Field.FullName
source: Full Name
es_es: Nombre Completo

# Forms.Field.BirthDate
source: Birth Date
es_es: Fecha de Nacimiento

# Forms.TemplateNotFound
source: Form template not found.
es_es: Plantilla de formulario no encontrada.

# Forms.TemplateCreated
source: Form template created successfully.
es_es: Plantilla de formulario creada exitosamente.

# Forms.ValidationRequired
source: This field is required.
es_es: Este campo obligatorio.

# Forms.ValidationInvalid
source: Invalid value for this field.
es_es: Valor inválido para este campo.

# Forms.PdfGenerated
source: Form PDF generated successfully.
es_es: PDF del formulario generado exitosamente.

# Forms.MissingRequiredField
source: Required field '{fieldName}' is missing or empty.
es_es: El campo obligatorio '{fieldName}' falta o está vacío.

# Forms.CaseNotAccessible
source: You do not have access to this case for form generation.
es_es: No tienes acceso a este caso para la generación de formularios.

# AdminSettings.Updated
source: Admin settings updated successfully.
es_es: Configuraciones de administrador actualizadas exitosamente.

# AdminSettings.ValidationError
source: Invalid setting value provided.
es_es: Valor de configuración inválido proporcionado.

# AdminSettings.RetentionDaysInvalid
source: Retention days must be between 1 and 3650.
es_es: Los días de retención deben estar entre 1 y 3650.

# AdminSettings.UploadSizeInvalid
source: Upload size must be between 1 and 500 MB.
es_es: El tamaño de carga debe estar entre 1 y 500 MB.

# AdminSettings.BufferMinutesInvalid
source: Buffer minutes must be between 0 and 120.
es_es: Los minutos de buffer deben estar entre 0 y 120.

source: Retention processing started.
es_es: Procesamiento de retención iniciado.

# Retention.ProcessingCompleted
source: Retention processing completed. {itemCount} items processed.
es_es: Procesamiento de retención completado. {itemCount} elementos procesados.

# Retention.ItemQueued
source: Item queued for {action}: {category} - {targetId}
es_es: Elemento puesto en cola para {action}: {category} - {targetId}

# Retention.ActionExecuted
source: Retention action executed: {action} on {targetId}
es_es: Acción de retención ejecutada: {action} en {targetId}

# Scraper.RunStarted
source: Scraper run started for {visaType} {country}.
es_es: Iniciando ejecución del scraper para {0} países y {1} tipos de visa

# Scraper.RunCompleted
source: Scraper run completed successfully.
es_es: Ejecución del scraper completada. Procesados: {0} países, Borradores: {1}, Sin cambios: {2}

# Scraper.DraftCreated
source: Draft workflow created: {workflowId} with {changeCount} changes.
es_es: Borrador creado para {0} {1} versión {2} con {3} cambios

# Scraper.AndorraUsesSpain
source: Using {toCountry} panel physicians for {fromCountry} (country mapping).
es_es: Usando médicos del panel de {1} para {0}

# Workflow.MissingParameters
source: Both visaType and country parameters are required.
es_es: Los parámetros de tipo de visa y país son obligatorios

# Workflow.VisaTypeNotFound
source: Visa type '{visaType}' not found.
es_es: Tipo de visa '{0}' no encontrado

# Workflow.LookupNotFound
source: Workflow not found.
es_es: No se encontró flujo de trabajo aprobado para los criterios especificados

# Workflow.LookupOk
source: Workflow lookup succeeded for VisaType '{0}', Country '{1}', Version '{2}'.
es_es: Búsqueda exitosa de flujo de trabajo: {0} {1} versión {2}

source: Workflow not found.
es_es: Flujo de trabajo no encontrado

# Workflow.NotPending
source: Workflow is not in pending approval status.
es_es: El flujo de trabajo no está pendiente de aprobación

# Workflow.PendingStatus
source: Pending Approval
es_es: Pendiente de Aprobación

# Workflow.Approved
source: Workflow {workflowId} approved by {userId}.
es_es: Flujo de trabajo {0} aprobado por usuario {1}

# Workflow.ApprovedSuccess
source: Workflow approved successfully.
es_es: Flujo de trabajo aprobado exitosamente

# Workflow.RejectedSuccess
source: Workflow rejected successfully.
es_es: Flujo de trabajo rechazado exitosamente

# GraphMail.TestEmailSent
source: Email sent successfully via Fake provider
es_es: Correo enviado exitosamente

# GraphMail.AdminOnly
source: This endpoint is only available to administrators.
es_es: Este endpoint solo está disponible para administradores.

# Payments.WebhookProcessed
source: Webhook processed successfully
es: Webhook procesado exitosamente

# Payments.WebhookRejected
source: Webhook rejected
es: Webhook rechazado

# Payments.CheckoutCreated
source: Checkout session created successfully
es: Sesión de pago creada

# Payments.CheckoutFailed
source: Failed to create checkout session
es: Error al crear sesión de pago

# Graph.TestMailSubject
source: Test Email from Law4Hire
es: Correo de Prueba de Law4Hire

# Graph.TestMailBody
source: This is a test email to verify Graph integration is working correctly.
es: Este es un correo de prueba para verificar que la integración de Graph funciona correctamente.

# Graph.TestMailSent
source: Test email sent successfully
es: Correo de prueba enviado exitosamente

# Graph.TestMailError
source: Failed to send test email
es: Error al enviar correo de prueba

# Availability.RetrievalFailed
source: Calendar availability could not be retrieved
es: No se pudo recuperar la disponibilidad del calendario

# Availability.RetrievalError
source: Error retrieving calendar availability
es: Error al recuperar la disponibilidad del calendario

# Appointments.CreatedSuccessfully
source: Appointment created successfully
es: Cita creada exitosamente

# Appointments.CreationFailed
source: Failed to create appointment
es: Error al crear cita

# Appointments.CreationError
source: Error creating appointment
es: Error al crear cita

# Payments.CheckoutError
source: Error creating checkout session
es: Error al crear sesión de pago

# Payments.WebhookIgnored
source: Webhook ignored
es: Webhook ignorado

# Payments.WebhookError
source: Webhook processing error
es: Error al procesar webhook

# Payments.CheckoutCompleted
source: Checkout completed successfully
es: Pago completado exitosamente

# Payments.RefundProcessed
source: Refund processed successfully
es: Reembolso procesado exitosamente
